Revit 2027 API
BuiltInFailures.ImportFailures.ImportTooManyElmentsToExplode Property
 Import Instance has [Number] elements. Imports with more than 10,000 elements cannot be exploded.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ImportTooManyElmentsToExplode { get; }
Public Shared ReadOnly Property ImportTooManyElmentsToExplode As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ImportTooManyElmentsToExplode {
	FailureDefinitionId^ get ();
}
static member ImportTooManyElmentsToExplode : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ImportFailures Class
Autodesk.Revit.DB Namespace